#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

//按位与&按位或|按位异或^
int main()
{
	int a = 2;
	int b = 5;
	//int c = a&b;//&按二进制位与同真为真，其余为假
	////a的二进制有效位表示为0010
	////b的二进制有效位表示为0101
	////按位与的结果         0000
	////所以输出结果为0

	//int c = a | b;//|按二进制位或同假为假，其余为真
	////a的二进制有效位表示为0010
	////b的二进制有效位表示为0101
	////按位或的结果         0111
	////所以输出结果为7

	int c = a^b;//^按二进制位异或对应二进制位相同为0，相异为1
	//a的二进制有效位表示为0010
	//b的二进制有效位表示为0101
	//按位异或的结果       0111
	//所以输出结果为7
	printf("%d",c);

	return 0;
}



//不能创建第三个变量使两个数交换
int main()
{
	int a = 2;
	int b = 5;
	printf("a=%d,b=%d\n", a, b);
	//创建第三个变量
	/*int c = 0;
	c = a;
	a = b;
	b = c;*/
	//多用创建第三个变量交换

	//用+ -运算交换
	//a = a + b;//将a+b赋给a,a变成了7（2+5）
	//b = a - b;//将a-b赋给b,b变成了2（7-5）a还是7
	//a = a - b;//将a-b赋给a,a变成了5（7-2）此时a=5,b=2完成了交换
	//注意：这种方法可能导致溢出

	//用^操作符交换
	//a的二进制有效位表示为0010
	//b的二进制有效位表示为0101
	a = a^b;//此时a的二进制有效位表示为0111,b的二进制有效位表示为0101;转化为十进制a=7,b=5
	b = a^b;//此时a的二进制有效位表示为0111,b的二进制有效位表示为0010;转化为十进制a=7,b=2
	a = a^b;//此时a的二进制有效位表示为0101,b的二进制有效位表示为0010;转化为十进制a=2,b=5；完成了交换

	printf("a=%d,b=%d\n", a, b);
	return 0;
}

//编写代码实现：求一个整数存储在内存中二进制中1的个数
int main()
{
	int i = 0;
	int count = 0;
	scanf("%d", &i);
	//while (i)
	//{
	//	if (i % 2 == 1)
	//		count++;
	//		i =i>>1;//也可以写成i=i/2;i/2减少1位；举例0101/2=010；商010余1
	//}
	while (i)
	{
		i = i&(i - 1);
		count++;
	}
	printf("二进制中1的个数为%d\n",count);
	return 0;
}




